samuelpoiraud/robot/STM32/QS/QS_ax12.c
/*
 *	Club Robot ESEO 2010 - 2013
 *	???
 *
 *	Fichier : QS_ax12.h
 *	Package : Qualite Software
 *	Description : Module de gestion des servomoteurs Dynamixel AX12/AX12+
 *	Auteur : Ronan, Jacen, modifié et complété par Alexis (2012-2013)
 *	Licence : CeCILL-C (voir LICENCE.txt)
 *	Version 20121110
 */

//Pour voir l'ancienne version avant les modifications faites pour le robot 2012-2013, utilisez la version SVN 5340

#include "QS_ax12.h"

#ifdef USE_AX12_SERVO

#include "QS_ports.h"
#include "QS_outputlog.h"
#include "stm32f4xx_usart.h"

#ifdef NEW_CONFIG_ORGANISATION
	#include "config_pin.h"
#endif

	/**********************************************************************/
	/** Paramètres de configuration du driver AX12                        */
	/**********************************************************************/

	#if !defined(AX12_NUMBER) || AX12_NUMBER > 254
		#error "Vous devez definir un nombre de servo sur le robot (AX12_NUMBER) (254 max)"
	#endif /* ndef AX12_NUMBER */

	//#define AX12_DEBUG_PACKETS: si défini, les paquets envoyé sont écrit sur la sortie uart en utilisant debug_printf (attention, debug_printf n'est pas réentrante)

	#ifndef AX12_UART_ID
		#define AX12_UART_ID 2
	#endif

	#if AX12_UART_ID == 1
		#define AX12_UART_Ptr USART1
		#define AX12_UART_Interrupt USART1_IRQHandler
		#define AX12_UART_Interrupt_IRQn USART1_IRQn
	#elif AX12_UART_ID == 2
		#define AX12_UART_Ptr USART2
		#define AX12_UART_Interrupt USART2_IRQHandler
		#define AX12_UART_Interrupt_IRQn USART2_IRQn
	#elif AX12_UART_ID == 3
		#define AX12_UART_Ptr USART3
		#define AX12_UART_Interrupt USART3_IRQHandler
		#define AX12_UART_Interrupt_IRQn USART3_IRQn
	#else
	#warning "AX12: Unknown UART ID"
	#endif

	#if AX12_RX24_UART_ID == 1
		#define AX12_RX24_UART_Ptr USART1
		#define AX12_RX24_UART_Interrupt USART1_IRQHandler
		#define AX12_RX24_UART_Interrupt_IRQn USART1_IRQn
	#elif AX12_RX24_UART_ID == 2
		#define AX12_RX24_UART_Ptr USART2
		#define AX12_RX24_UART_Interrupt USART2_IRQHandler
		#define AX12_RX24_UART_Interrupt_IRQn USART2_IRQn
	#elif AX12_RX24_UART_ID == 3
		#define AX12_RX24_UART_Ptr USART3
		#define AX12_RX24_UART_Interrupt USART3_IRQHandler
		#define AX12_RX24_UART_Interrupt_IRQn USART3_IRQn
	#else
	#warning "RX24: Unknown UART ID"
	#endif

	#ifndef AX12_UART_BAUDRATE
		#define AX12_UART_BAUDRATE  56700
	#endif

	#ifndef AX12_STATUS_RETURN_TIMEOUT
		#define AX12_STATUS_RETURN_TIMEOUT 50	//Ne pas mettre une valeur trop proche de celle prévue, l'AX12 répond parfois avec un delai plus long
	#endif

	#ifndef AX12_STATUS_SEND_TIMEOUT
		#define AX12_STATUS_SEND_TIMEOUT 10
	#endif

	#ifndef AX12_STATUS_RETURN_MODE
		#define AX12_STATUS_RETURN_MODE AX12_STATUS_RETURN_ONREAD
	#endif

	#ifndef AX12_INSTRUCTION_BUFFER_SIZE
		#define AX12_INSTRUCTION_BUFFER_SIZE (5*AX12_NUMBER)
	#endif

	/**********************************************************************/
	/** Configuration du timer pour le timeout de réception du status    **/
	/**********************************************************************/

	#ifdef AX12_TIMER_ID
		#define TIMER_SRC_TIMER_ID AX12_TIMER_ID
	#endif
	#ifdef AX12_TIMER_USE_WATCHDOG
		#define TIMER_SRC_USE_WATCHDOG
	#endif

	#include "QS_setTimerSource.h"

	/*************************************************************************************/

	/* UART2 exclusivement dédié à la gestion des servomoteurs AX-12+ */

	#ifdef USE_UART2
		#error "Vous ne pouvez pas utiliser l'UART2 et l'AX12 en même temps, l'AX12 à besoin de l'UART2 pour communiquer"
	#endif

	#ifndef AX12_DIRECTION_PORT
		#error "Vous devez definir un port de direction (AX12_DIRECTION_PORT) pour gérer l'UART qui est en Half-duplex (cf. Datasheet MAX485)"
	#endif /* ndef AX12_DIRECTION_PORT */

	/* Pour UART half-uplex */
	#define TX_DIRECTION 1
	#define RX_DIRECTION 0


	/*************************************************************************************/
	/** Constantes liées au instruction envoyées a l'AX12                               **/
	/*************************************************************************************/

	/* Instructions */

	#define INST_PING 				0x01
	#define INST_READ 				0x02
	#define INST_WRITE 				0x03
	#define INST_REG_WRITE 			0x04
	#define INST_ACTION 			0x05
	//Instructions non utilisées
	//#define INST_RESET 				0x06
	//#define INST_DIGITAL_RESET 		0x07
	//#define INST_SYSTEM_READ 		0x0C
	//#define INST_SYSTEM_WRITE 		0x0D
	//#define INST_SYNC_WRITE 		0x83
	//#define INST_SYNC_REG_WRITE 	0x84

	// Adresses de la mémoire interne de l'AX12
	#define AX12_MEM_SIZE		0x32

	#define AX12_MIN_VALUE_0	0x00
	#define AX12_MIN_VALUE_1	0x01
	#define AX12_MIN_VALUE_34	0x02
	#define AX12_MIN_VALUE_50	0x03

	#define AX12_MAX_VALUE_1	0x70
	#define AX12_MAX_VALUE_2	0x60
	#define AX12_MAX_VALUE_127	0x50
	#define AX12_MAX_VALUE_150	0x40
	#define AX12_MAX_VALUE_250	0x30
	#define AX12_MAX_VALUE_253	0x20
	#define AX12_MAX_VALUE_254	0x10
	#define AX12_MAX_VALUE_1023	0x00

	//Les defines sont globaux, il sont défini en même temps que le tableau des valeurs accepté par l'AX12 pour pouvoir voir à quelle valeur les limites correspondent
	static const Uint8 AX12_values_ranges[0x32] = {
		//EEPROM, utilisé par les fonctions AX12_config_*, les valeurs persiste après une mise hors tension.
		#define AX12_MODEL_NUMBER_L 			0x00
			0,	//non utilisé
		#define AX12_MODEL_NUMBER_H				0x01
			0,	//non utilisé
		#define AX12_VERSION					0x02
			0,	//non utilisé
		#define AX12_ID 						0x03
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_253,
		#define AX12_BAUD_RATE					0x04
			AX12_MIN_VALUE_34 | AX12_MAX_VALUE_254,	//la limite de l'AX12 est 0-254, mais la carte ne supporte pas des vitesses supérieures à 56700bauds.
		#define AX12_RETURN_DELAY_TIME			0x05
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,	//Maximum de 508 us
		#define AX12_CW_ANGLE_LIMIT_L			0x06
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1023,
		#define AX12_CW_ANGLE_LIMIT_H			0x07
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define AX12_CCW_ANGLE_LIMIT_L			0x08
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1023,
		#define AX12_CCW_ANGLE_LIMIT_H			0x09
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define AX12_SYSTEM_DATA2				0x0A
			0,	//non utilisé
		#define AX12_LIMIT_TEMPERATURE			0x0B
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_150,
		#define AX12_DOWN_LIMIT_VOLTAGE 		0x0C
			AX12_MIN_VALUE_50 | AX12_MAX_VALUE_250,
		#define AX12_UP_LIMIT_VOLTAGE			0x0D
			AX12_MIN_VALUE_50 | AX12_MAX_VALUE_250,
		#define AX12_MAX_TORQUE_L				0x0E
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1023,
		#define AX12_MAX_TORQUE_H				0x0F
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define AX12_RETURN_LEVEL				0x10
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_2,
		#define AX12_ALARM_LED					0x11
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_127,
		#define AX12_ALARM_SHUTDOWN 			0x12
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_127,
		#define AX12_OPERATING_MODE 			0x13
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1,
		#define AX12_DOWN_CALIBRATION_L 		0x14
			0,	//non utilisé
		#define AX12_DOWN_CALIBRATION_H 		0x15
			0,	//non utilisé
		#define AX12_UP_CALIBRATION_L			0x16
			0,	//non utilisé
		#define AX12_UP_CALIBRATION_H			0x17
			0,	//non utilisé

		//RAM de l'AX12, reinitialisé après une mise hors tension
		#define AX12_TORQUE_ENABLE				0x18
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1,
		#define AX12_LED						0x19
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1,
		#define AX12_CW_COMPLIANCE_MARGIN		0x1A
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,
		#define AX12_CCW_COMPLIANCE_MARGIN		0x1B
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,
		#define AX12_CW_COMPLIANCE_SLOPE		0x1C
			AX12_MIN_VALUE_1 | AX12_MAX_VALUE_254,
		#define AX12_CCW_COMPLIANCE_SLOPE		0x1D
			AX12_MIN_VALUE_1 | AX12_MAX_VALUE_254,
		#define AX12_GOAL_POSITION_L			0x1E
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1023,
		#define AX12_GOAL_POSITION_H			0x1F
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define AX12_GOAL_SPEED_L				0x20
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1023,
		#define AX12_GOAL_SPEED_H				0x21
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define AX12_TORQUE_LIMIT_L				0x22
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1023,
		#define AX12_TORQUE_LIMIT_H 			0x23
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define AX12_PRESENT_POSITION_L 		0x24
			0,	//non utilisé
		#define AX12_PRESENT_POSITION_H 		0x25
			0,	//non utilisé
		#define AX12_PRESENT_SPEED_L			0x26
			0,	//non utilisé
		#define AX12_PRESENT_SPEED_H			0x27
			0,	//non utilisé
		#define AX12_PRESENT_LOAD_L 			0x28
			0,	//non utilisé
		#define AX12_PRESENT_LOAD_H 			0x29
			0,	//non utilisé
		#define AX12_PRESENT_VOLTAGE			0x2A
			0,	//non utilisé
		#define AX12_PRESENT_TEMPERATURE		0x2B
			0,	//non utilisé
		#define AX12_REGISTERED_INSTRUCTION		0x2C
			0,	//non utilisé
		#define AX12_PAUSE_TIME 				0x2D
			0,	//non utilisé
		#define AX12_MOVING 					0x2E
			0,	//non utilisé
		#define AX12_LOCK						0x2F
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1,
		#define AX12_PUNCH_L					0x30
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_1023,
		#define AX12_PUNCH_H					0x31
			AX12_MIN_VALUE_0 | AX12_MAX_VALUE_254	//ne devrait pas être utilisé
	};

	/***********************************************************************/
	/** Autre définitions internes                                        **/
	/***********************************************************************/

	//Si défini, on teste le checksum des paquets de status, si le resultat est incorrect, le paquet est ignoré
	//#define AX12_STATUS_RETURN_CHECK_CHECKSUM

	//nous avons besoin d'une place en plus pour pouvoir différencier le cas ou le buffer est vide du cas ou il est plein
	#define AX12_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE (AX12_INSTRUCTION_BUFFER_SIZE+1)

