samuelpoiraud/robot/STM32/QS/QS_ax12.c
static bool_e AX12_instruction_queue_insert(const AX12_instruction_packet_t* inst);
#define AX12_status_packet_is_full(status_packet, bytes_received) (((bytes_received) >= 4) && ((bytes_received) >= status_packet.size))	//on doit avoir lu la taille du paquet (>= 4) et avoir lu tous les octets du paquet
#define AX12_instruction_queue_is_full() (INC_WITH_MOD(AX12_special_instruction_buffer.end_index, AX12_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE) == AX12_special_instruction_buffer.start_index)	//buffer plein si le prochain index de fin est l'index de début du buffer
#define AX12_instruction_queue_is_empty() (AX12_special_instruction_buffer.end_index == AX12_special_instruction_buffer.start_index)
#define AX12_instruction_queue_next() \
	(AX12_special_instruction_buffer.start_index = INC_WITH_MOD(AX12_special_instruction_buffer.start_index, AX12_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE))
#define AX12_instruction_queue_get_current() \
	AX12_special_instruction_buffer.buffer[AX12_special_instruction_buffer.start_index]


//retourne TRUE si l'instruction est suivie d'une réponse de l'AX12
//inst est de type AX12_instruction_packet_t
#define AX12_instruction_has_status_packet(inst) (inst.id_servo != AX12_BROADCAST_ID && (AX12_STATUS_RETURN_MODE == AX12_STATUS_RETURN_ALWAYS || inst.type == INST_PING || (AX12_STATUS_RETURN_MODE == AX12_STATUS_RETURN_ONREAD && inst.type == INST_READ)))

/*************************************************************************************/
/** Fonctions gérant l'envoi de paquet instruction par l'intermédiaire du buffer    **/
/*************************************************************************************/

#if AX12_STATUS_RETURN_MODE != AX12_STATUS_RETURN_NEVER
static bool_e AX12_instruction_async_read(Uint8 id_servo, Uint8 address, Uint8 length) {
	AX12_instruction_packet_t inst = {0};

	inst.id_servo = id_servo;
	inst.type = INST_READ;
	inst.address = address;
	inst.param_1 = length;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 2;

	return AX12_instruction_queue_insert(&inst);
}
#endif

static bool_e AX12_instruction_async_write8(Uint8 id_servo, Uint8 address, Uint8 value) {
	AX12_instruction_packet_t inst = {0};

	if((Uint16)value > AX12_decode_value_range(address, TRUE))
		value = AX12_decode_value_range(address, TRUE);

	if((Uint16)value < AX12_decode_value_range(address, FALSE))
		value = AX12_decode_value_range(address, FALSE);

	inst.id_servo = id_servo;
	inst.type = INST_WRITE;
	inst.address = address;
	inst.param_1 = value;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 2;

	return AX12_instruction_queue_insert(&inst);
}

static bool_e AX12_instruction_async_write16(Uint8 id_servo, Uint8 address, Uint16 value) {
	AX12_instruction_packet_t inst = {0};

	if(value > AX12_decode_value_range(address, TRUE))
		value = AX12_decode_value_range(address, TRUE);

	if(value < AX12_decode_value_range(address, FALSE))
		value = AX12_decode_value_range(address, FALSE);

	inst.id_servo = id_servo;
	inst.type = INST_WRITE;
	inst.address = address;
	inst.param = value;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 3;	//param is 16bits

	return AX12_instruction_queue_insert(&inst);
}

static bool_e AX12_instruction_async_prepare_write8(Uint8 id_servo, Uint8 address, Uint8 value) {
	AX12_instruction_packet_t inst = {0};

	if((Uint16)value > AX12_decode_value_range(address, TRUE))
		value = AX12_decode_value_range(address, TRUE);

	if((Uint16)value < AX12_decode_value_range(address, FALSE))
		value = AX12_decode_value_range(address, FALSE);

	inst.id_servo = id_servo;
	inst.type = INST_REG_WRITE;
	inst.address = address;
	inst.param_1 = value;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 2;

	return AX12_instruction_queue_insert(&inst);
}

static bool_e AX12_instruction_async_prepare_write16(Uint8 id_servo, Uint8 address, Uint16 value) {
	AX12_instruction_packet_t inst = {0};

	if(value > AX12_decode_value_range(address, TRUE))
		value = AX12_decode_value_range(address, TRUE);

	if(value < AX12_decode_value_range(address, FALSE))
		value = AX12_decode_value_range(address, FALSE);

	inst.id_servo = id_servo;
	inst.type = INST_REG_WRITE;
	inst.address = address;
	inst.param = value;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 3;	//param is 16bits

	return AX12_instruction_queue_insert(&inst);
}

static bool_e AX12_instruction_async_execute_write() {
	AX12_instruction_packet_t inst = {0};

	inst.id_servo = AX12_BROADCAST_ID;
	inst.type = INST_ACTION;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE;

	return AX12_instruction_queue_insert(&inst);
}

#if AX12_STATUS_RETURN_MODE != AX12_STATUS_RETURN_NEVER
static Uint8 AX12_instruction_read8(Uint8 id_servo, Uint8 address, bool_e *isOk) {
	if(!AX12_instruction_async_read(id_servo, address, 1)) {
		if(isOk) *isOk = FALSE;
		return 0;
	}

	if(!AX12_instruction_wait(id_servo)) {
		if(isOk) *isOk = FALSE;
		return 0;
	}

	if(isOk) *isOk = TRUE;
	return AX12_instruction_get_last_status(id_servo).param_1;
}

static Uint16 AX12_instruction_read16(Uint8 id_servo, Uint8 address, bool_e *isOk) {
	if(!AX12_instruction_async_read(id_servo, address, 2)) {
		if(isOk) *isOk = FALSE;
		return 0;
	}

	if(!AX12_instruction_wait(id_servo)) {
		if(isOk) *isOk = FALSE;
		return 0;
	}

	if(isOk) *isOk = TRUE;
	return AX12_instruction_get_last_status(id_servo).param;
}
#endif

static bool_e AX12_instruction_write8(Uint8 id_servo, Uint8 address, Uint8 value) {
	if(AX12_prepare_commands) {
		if(!AX12_instruction_async_prepare_write8(id_servo, address, value))
			return FALSE;
	} else {
		if(!AX12_instruction_async_write8(id_servo, address, value))
			return FALSE;
	}

	#if AX12_STATUS_RETURN_MODE == AX12_STATUS_RETURN_ALWAYS
		if(id_servo == AX12_BROADCAST_ID)
			return TRUE;
		if(!AX12_instruction_wait(id_servo))
			return FALSE;
		return AX12_instruction_get_last_status(id_servo).error == 0;
	#endif

	return TRUE;
}

static bool_e AX12_instruction_write16(Uint8 id_servo, Uint8 address, Uint16 value) {
	if(AX12_prepare_commands) {
		if(!AX12_instruction_async_prepare_write16(id_servo, address, value))
			return FALSE;
	} else {
		if(!AX12_instruction_async_write16(id_servo, address, value))
			return FALSE;
	}

	#if AX12_STATUS_RETURN_MODE == AX12_STATUS_RETURN_ALWAYS
		if(id_servo == AX12_BROADCAST_ID)
			return TRUE;
		if(!AX12_instruction_wait(id_servo))
			return FALSE;
		return AX12_instruction_get_last_status(id_servo).error == 0;
	#endif

