samuelpoiraud/robot/STM32/QS/QS_ax12.c
	return TRUE;
}

static bool_e AX12_instruction_ping(Uint8 id_servo) {
	AX12_instruction_packet_t inst = {0};

	inst.id_servo = id_servo;
	inst.type = INST_PING;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE;

	if(!AX12_instruction_queue_insert(&inst))
		return FALSE;

	if(!AX12_instruction_wait(id_servo))
		return FALSE;

	return (AX12_instruction_get_last_status(id_servo).error & AX12_ERROR_TIMEOUT) == 0;
}

static bool_e AX12_instruction_buffer_is_full() {
	return AX12_instruction_queue_is_full();
}

static bool_e AX12_instruction_wait(Uint8 id_servo) {
	Uint32 i = 0;
	//debug_printf("+1\n");
	while(!AX12_instruction_queue_is_empty() && i < 65000000)	//si i atteint 65000, on stop, on a attendu trop longtemps (au moins 6,5ms à une clock de 10Mhz, mais ce bout de code ne fait qu'une instruction)
		i++;

	if(i < 65000000) return TRUE;

	debug_printf("AX12 Wait too long %d / %d\n", AX12_special_instruction_buffer.start_index, AX12_special_instruction_buffer.end_index);
	AX12_on_the_robot[id_servo].last_status.error = AX12_ERROR_TIMEOUT | AX12_ERROR_RANGE;	//On a attendu trop longtemps, le buffer est toujours plein
	AX12_on_the_robot[id_servo].last_status.param = 0;
	return FALSE;
}

static AX12_status_t AX12_instruction_get_last_status(Uint8 id_servo)
{
	return AX12_on_the_robot[id_servo].last_status;
}

static void AX12_instruction_reset_last_status(Uint8 id_servo) {
	AX12_on_the_robot[id_servo].last_status.error = AX12_ERROR_OK;
	AX12_on_the_robot[id_servo].last_status.param = 0;
}

/*****************************************************************************/
/** Fonctions internes pour la gestion des paquets et les limites de valeur **/
/*****************************************************************************/

static inline Uint16 AX12_decode_value_range(Uint8 mem_addr, bool_e get_max) {
	if(mem_addr >= AX12_MEM_SIZE) return 0;

	if(!get_max) {
		switch(AX12_values_ranges[mem_addr] & 0x0F) {
			case AX12_MIN_VALUE_0:  return 0;
			case AX12_MIN_VALUE_1:  return 1;
			case AX12_MIN_VALUE_34: return 34;
			case AX12_MIN_VALUE_50: return 50;
		}
	} else {
		switch(AX12_values_ranges[mem_addr] & 0xF0) {
			case AX12_MAX_VALUE_1023: return 1023;
			case AX12_MAX_VALUE_254:  return 254;
			case AX12_MAX_VALUE_253:  return 253;
			case AX12_MAX_VALUE_250:  return 250;
			case AX12_MAX_VALUE_150:  return 150;
			case AX12_MAX_VALUE_127:  return 127;
			case AX12_MAX_VALUE_2:    return 2;
			case AX12_MAX_VALUE_1:    return 1;
		}
	}

	return 0;
}

static Uint8 AX12_instruction_packet_calc_checksum(AX12_instruction_packet_t* instruction_packet) {
	Uint8 checksum = 0;
	Uint8 packet_length = instruction_packet->size - 4;

	if(instruction_packet->size < 6)
		debug_printf("AX12: Error: in AX12_instruction_packet_calc_checksum(): paquet trop petit");

	//packet_length est forcément >= 2 (voir datasheet de l'ax12)
	//PAS de break, si il y a 3 paramètres (packet_length = 3 +2), on fait toutes les additions
	switch(packet_length) {
		case 5:	//3 paramètres
			checksum += instruction_packet->param_2;
		case 4:	//2 paramètres
			checksum += instruction_packet->param_1;
		case 3:	//1 paramètre
			checksum += instruction_packet->address;
		case 2:	//pas de paramètre
			checksum += instruction_packet->id_servo + packet_length + instruction_packet->type;
			break;

		default:
			debug_printf("AX12: Error: AX12_instruction_packet_calc_checksum(): paquet trop grand");
	}

	return ~checksum;
}

static Uint8 AX12_get_instruction_packet(Uint8 byte_offset, AX12_instruction_packet_t* instruction_packet) {

	if(byte_offset == instruction_packet->size - 1)	//si c'est le dernier octet, envoyer le checksum
		return AX12_instruction_packet_calc_checksum(instruction_packet);

	switch(byte_offset)
	{
		case 0:	//PAS de break, on retourne 0xFF pour les octets numéro 0 et 1
		case 1: return 0xFF;
		case 2: return instruction_packet->id_servo;
		case 3: return instruction_packet->size - 4;
		case 4: return instruction_packet->type;
		case 5:	return instruction_packet->address;
		case 6: return instruction_packet->param_1;
		case 7: return instruction_packet->param_2;

		default:
			if(byte_offset > 7)
				debug_printf("AX12: Warning: byte_offset > 7\r\n");
	}

	//Si on atteint cette ligne, byte_offset > 7, on retourne 0 par défaut (ça ne devrais jamais arriver)
	return 0;
}

#ifdef AX12_STATUS_RETURN_CHECK_CHECKSUM
static Uint8 AX12_status_packet_calc_checksum(AX12_status_packet_t* status_packet) {
	Uint8 checksum = 0;
	Uint8 packet_length = status_packet->size - 4;

	if(status_packet->size < 6)
		debug_printf("AX12: Error: in AX12_status_packet_calc_checksum(): paquet trop petit");

	//packet_length est forcément >= 2 (voir datasheet de l'ax12)
	//PAS de break, si il y a 2 paramètre, on fait toutes les additions
	switch(packet_length) {
		case 4:	//2 paramètres
			checksum += status_packet->param_2;
		case 3:	//1 paramètre
			checksum += status_packet->param_1;
		case 2:	//pas de paramètre
			checksum += status_packet->id_servo + packet_length + (status_packet->error & 0xFF);
			break;

		default:
			debug_printf("AX12: Error: AX12_status_packet_calc_checksum(): paquet trop grand");
	}

	return ~checksum;
}
#endif

static bool_e AX12_update_status_packet(Uint8 receive_byte, Uint8 byte_offset, AX12_status_packet_t* status_packet)
{
	//Si c'est le dernier octet, verifier le checksum si AX12_STATUS_RETURN_CHECK_CHECKSUM est defini
	if(byte_offset > 3 && byte_offset == status_packet->size - 1) {
	#ifdef AX12_STATUS_RETURN_CHECK_CHECKSUM
		if(receive_byte != AX12_status_packet_calc_checksum(status_packet)) {
			debug_printf("AX12[%d]: invalid checksum\n", status_packet->id_servo);
			return FALSE;
		} else return TRUE;
	#else
		return TRUE;
	#endif
	}

	//mise a jour de la structure instruction avec les octets reçus
	switch(byte_offset)
	{
		case 0:
			//Initialisation de a structure a des valeurs par défaut
			status_packet->id_servo = 0;
			status_packet->size = 0;
			//status_packet->error = 0; contient IN_PROGRESS déjà
			status_packet->param = 0;

