samuelpoiraud/robot/STM32/QS/QS_ax12.c
	if(event == AX12_SME_RxInterrupt || event == AX12_SME_TxInterruptAX12 || event == AX12_SME_TxInterruptRX24) {
		TIMER_SRC_TIMER_EnableIT();
	} else if(event == AX12_SME_Timeout) {
		AX12_UART_EnableIRQ();
	} else if(event == AX12_SME_NoEvent) {
		processing_state = 0;
	}
}

/*********************************************************************************/
/** Implémentation des fonctions gérant le buffer d'instruction (insertion ici) **/
/*********************************************************************************/

static bool_e AX12_instruction_queue_insert(const AX12_instruction_packet_t* inst) {	//utilisation d'un pointeur pour eviter de provoquer une copie intégrale de la structure, qui pourrait prendre du temps si elle est trop grande
	Uint16 i = 0;
	//Uint16 truc;

	while(AX12_instruction_queue_is_full() && i < 65000)	//boucle 65000 fois si le buffer reste full, si on atteint 65000, on échoue et retourne FALSE
		i++;

	if(i >= 65000) {
		if(inst->id_servo < AX12_NUMBER) {
			AX12_on_the_robot[inst->id_servo].last_status.error = AX12_ERROR_TIMEOUT | AX12_ERROR_RANGE;
			AX12_on_the_robot[inst->id_servo].last_status.param = 0;
		}
		debug_printf("AX12 Fatal: Instruction buffer full !\n");
		return FALSE;	//return false, on a pas réussi a insérer l'instruction, problème de priorité d'interruptions ?
	}

	AX12_on_the_robot[inst->id_servo].last_status.error = AX12_ERROR_IN_PROGRESS;
	AX12_special_instruction_buffer.buffer[AX12_special_instruction_buffer.end_index] = *inst;
	AX12_special_instruction_buffer.end_index = INC_WITH_MOD(AX12_special_instruction_buffer.end_index, AX12_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE);
	//truc = state_machine.state;
	//if(truc == AX12_SMS_ReadyToSend)
		AX12_state_machine(AX12_SME_NoEvent);
	//else debug_printf("ax12 not ready, in state %d\n", truc);

	return TRUE;
}

/**************************************************************************/
/** Fonction initialisant l'UART2 utilisé pour communiquer               **/
/**************************************************************************/

/*	vitesse : 57600 bauds (modifiable: uart_speed)
	bits de donnees : 8
	parite : aucune
	bit de stop : 1
	pas de controle de flux
*/

static void AX12_UART_init_all(Uint32 uart_speed)
{
	NVIC_InitTypeDef NVIC_InitStructure;

	PORTS_uarts_init();


	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;  //inférieur aux uarts mais supérieur au timers

#ifdef AX12_UART_ID
	AX12_UART_init(AX12_UART_Ptr, uart_speed);
	NVIC_InitStructure.NVIC_IRQChannel = AX12_UART_Interrupt_IRQn;
	NVIC_Init(&NVIC_InitStructure);
	debug_printf("UART %d initialized for AX12\n", AX12_UART_ID);
#endif

#ifdef AX12_RX24_UART_ID
	AX12_UART_init(AX12_RX24_UART_Ptr, uart_speed);
	NVIC_InitStructure.NVIC_IRQChannel = AX12_RX24_UART_Interrupt_IRQn;
	NVIC_Init(&NVIC_InitStructure);
	debug_printf("UART %d initialized for RX24\n", AX12_RX24_UART_ID);
#endif
}

static void AX12_UART_init(USART_TypeDef* uartPtr, Uint16 baudrate) {
	USART_InitTypeDef USART_InitStructure;

	if(uartPtr == USART1)
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	else if(uartPtr == USART2)
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	else if(uartPtr == USART3)
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
	else {
		fatal_printf("UART inconnu !!! %p\n", uartPtr);
		assert(0 && "Uart inconnu");
	}

	USART_OverSampling8Cmd(uartPtr, ENABLE);

	USART_InitStructure.USART_BaudRate = baudrate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(uartPtr, &USART_InitStructure);


	/* Enable USART */
	USART_Cmd(uartPtr, ENABLE);

	USART_ITConfig(uartPtr, USART_IT_RXNE, ENABLE);
	USART_ITConfig(uartPtr, USART_IT_TXE, DISABLE);
}

static void AX12_UART_DisableIRQ() {
#ifdef AX12_UART_Interrupt_IRQn
	NVIC_DisableIRQ(AX12_UART_Interrupt_IRQn);
#endif
#ifdef AX12_RX24_UART_Interrupt_IRQn
	NVIC_DisableIRQ(AX12_RX24_UART_Interrupt_IRQn);
#endif
}

static void AX12_UART_EnableIRQ() {
#ifdef AX12_UART_Interrupt_IRQn
	NVIC_EnableIRQ(AX12_UART_Interrupt_IRQn);
#endif
#ifdef AX12_RX24_UART_Interrupt_IRQn
	NVIC_EnableIRQ(AX12_RX24_UART_Interrupt_IRQn);
#endif
}

static void AX12_UART_putc(Uint8 c) {
#ifdef AX12_UART_Ptr
	USART_SendData(AX12_UART_Ptr, c);
#endif
#ifdef AX12_RX24_UART_Ptr
	USART_SendData(AX12_RX24_UART_Ptr, c);
#endif
}

static Uint8 AX12_UART_getc() {
#ifdef AX12_UART_Ptr
	if(USART_GetFlagStatus(AX12_UART_Ptr, USART_FLAG_RXNE))
		return USART_ReceiveData(AX12_UART_Ptr);
#endif
#if defined(AX12_UART_Ptr) && defined(AX12_RX24_UART_Ptr)
	else
#endif
#ifdef AX12_RX24_UART_Ptr
		if(USART_GetFlagStatus(AX12_RX24_UART_Ptr, USART_FLAG_RXNE))
			return USART_ReceiveData(AX12_RX24_UART_Ptr);
#endif

	return 0;
}

static bool_e AX12_UART_GetFlagStatus(Uint16 flag) {
	if(flag == USART_FLAG_TC) {
		if(
		#ifdef AX12_UART_Ptr
				USART_GetFlagStatus(AX12_UART_Ptr, flag)
		#endif
		#if defined(AX12_UART_Ptr) && defined(AX12_RX24_UART_Ptr)
				&&
		#endif
		#ifdef AX12_RX24_UART_Ptr
				USART_GetFlagStatus(AX12_RX24_UART_Ptr, flag)
		#endif
				)
			return TRUE;
	} else {
		if(
		#ifdef AX12_UART_Ptr
				USART_GetFlagStatus(AX12_UART_Ptr, flag)
		#endif
		#if defined(AX12_UART_Ptr) && defined(AX12_RX24_UART_Ptr)
				||
		#endif
		#ifdef AX12_RX24_UART_Ptr
				USART_GetFlagStatus(AX12_RX24_UART_Ptr, flag)
		#endif
				)
			return TRUE;
	}
	return FALSE;
}

static void AX12_UART_ITConfig(Uint16 flag, FunctionalState enable) {
#ifdef AX12_UART_Ptr
	USART_ITConfig(AX12_UART_Ptr, flag, enable);
#endif
#ifdef AX12_RX24_UART_Ptr
	USART_ITConfig(AX12_RX24_UART_Ptr, flag, enable);
#endif
}

/*****************************************************************************/
/** Interruptions utilisées (Reception/Envoi UART2 et timer pour le timeout **/
/*****************************************************************************/


