samuelpoiraud/robot/STM32/QS/QS_ax12.c
//Attention ! Si on met a 0 le flag après avoir executé la machine a état,
//des interruptions peuvent être masquée
//(en gros il se peut qu'une interruption Tx arrive avant d'avoir terminée l'execution de la fonction,
//dans ce cas mettre le flag a 0 fait que l'interruption Tx n'est pas lancée)
//(car le caractère envoyé est envoyé plus vite que le retour de la fonction AX12_state_machine)
#ifdef AX12_UART_Interrupt
void _ISR AX12_UART_Interrupt(void)
{
	if(USART_GetITStatus(AX12_UART_Ptr, USART_IT_RXNE))
	{
		Uint8 i = 0;
		while(USART_GetFlagStatus(AX12_UART_Ptr, USART_FLAG_RXNE)) {		//On a une IT Rx pour chaque caratère reçu, donc on ne devrai pas tomber dans un cas avec 2+ char dans le buffer uart dans une IT
			if(state_machine.state != AX12_SMS_WaitingAnswer) {	//Arrive quand on allume les cartes avant la puissance ou lorsque l'on coupe la puissance avec les cartes alumées (reception d'un octet avec l'erreur FERR car l'entrée RX tombe à 0)
				USART_ReceiveData(AX12_UART_Ptr);
			} else {
				AX12_state_machine(AX12_SME_RxInterrupt);
				if(USART_GetFlagStatus(AX12_UART_Ptr, USART_FLAG_RXNE) && i > 5) {
					//debug_printf("Overinterrupt RX !\n");
					break; //force 0, on va perdre des caractères, mais c'est mieux que de boucler ici ...
				}
			}
			i++;
		}
	}
	else if(USART_GetITStatus(AX12_UART_Ptr, USART_IT_TXE))
	{
		AX12_state_machine(AX12_SME_TxInterruptAX12);
	}
}
#endif

#ifdef AX12_RX24_UART_Interrupt
void _ISR AX12_RX24_UART_Interrupt(void)
{
	if(USART_GetITStatus(AX12_RX24_UART_Ptr, USART_IT_RXNE))
	{
		Uint8 i = 0;
		while(USART_GetFlagStatus(AX12_RX24_UART_Ptr, USART_FLAG_RXNE)) {		//On a une IT Rx pour chaque caratère reçu, donc on ne devrai pas tomber dans un cas avec 2+ char dans le buffer uart dans une IT
			if(state_machine.state != AX12_SMS_WaitingAnswer) {	//Arrive quand on allume les cartes avant la puissance ou lorsque l'on coupe la puissance avec les cartes alumées (reception d'un octet avec l'erreur FERR car l'entrée RX tombe à 0)
				USART_ReceiveData(AX12_RX24_UART_Ptr);
			} else {
				AX12_state_machine(AX12_SME_RxInterrupt);
				if(USART_GetFlagStatus(AX12_RX24_UART_Ptr, USART_FLAG_RXNE) && i > 5) {
					//debug_printf("Overinterrupt RX !\n");
					break; //force 0, on va perdre des caractères, mais c'est mieux que de boucler ici ...
				}
			}
			i++;
		}
	}
	else if(USART_GetITStatus(AX12_RX24_UART_Ptr, USART_IT_TXE))
	{
		AX12_state_machine(AX12_SME_TxInterruptRX24);
	}
}
#endif

void TIMER_SRC_TIMER_interrupt()
{
	Uint8 i = 0;

	while(AX12_UART_GetFlagStatus(USART_FLAG_RXNE)) {		//On a une IT Rx pour chaque caratère reçu, donc on ne devrai pas tomber dans un cas avec 2+ char dans le buffer uart dans une IT
		if(state_machine.state != AX12_SMS_WaitingAnswer) {	//Arrive quand on allume les cartes avant la puissance ou lorsque l'on coupe la puissance avec les cartes alumées (reception d'un octet avec l'erreur FERR car l'entrée RX tombe à 0)
			AX12_UART_getc();
		} else {
			AX12_state_machine(AX12_SME_RxInterrupt);
			if(AX12_UART_GetFlagStatus(USART_FLAG_RXNE) && i > 5) {
				debug_printf("Overinterrupt RX ! while timeout\n");
				break; //force 0, on va perdre des caractères, mais c'est mieux que de boucler ici ...
			}
		}
		i++;
	}
	AX12_state_machine(AX12_SME_Timeout);
	TIMER_SRC_TIMER_resetFlag();
}

/**************************************************************************/
/** Fonctions d'interface utilisé par l'utilisateur du driver            **/
/**************************************************************************/

/* Fonction initialisant ce Driver	                                     */

void AX12_init() {
	static bool_e initialized = FALSE;
	Uint8 i;
	if(initialized)
		return;

	initialized = TRUE;

	AX12_UART_init_all(AX12_UART_BAUDRATE);
	TIMER_SRC_TIMER_init();
	AX12_DIRECTION_PORT = RX_DIRECTION;

	AX12_prepare_commands = FALSE;
	AX12_instruction_write8(AX12_BROADCAST_ID, AX12_RETURN_LEVEL, AX12_STATUS_RETURN_MODE);	//Mettre les AX12 dans le mode indiqué dans Global_config.h

	for(i=0; i<AX12_NUMBER; i++) {
		AX12_on_the_robot[i].angle_limit[0] = 0;
		AX12_on_the_robot[i].angle_limit[1] = 300;

		AX12_on_the_robot[i].is_wheel_enabled = FALSE;
		AX12_instruction_reset_last_status(i);
	}
}

/* Fonction d'utilisation de l'AX12                                        */

//Configuration de l'AX12, perdure après mise hors tension sauf pour le verouillage de la config (lock).
//Unités:
// Angles en degrés
// Vitesse en degrée par seconde
// Voltage en dixième de volt (50 => 5.0V)
// Température en degrée celcius
// Pourcentage entre 0 et 100

//Angle max: 360°
#define AX12_MAX_DEGRE 360
#define AX12_ANGLE_TO_DEGRE(angle) ((((Uint16)(angle))*75) >> 8) // >> 8 <=> / 256, 75/256 = 300/1024 = 0.29296875
//#define AX12_DEGRE_TO_ANGLE(angle) ((((Uint32)(angle)) << 8) / 75)	//L'utilisation d'entier 32bits est nécessaire, l'angle max 360° * 256 donne un nombre supérieur à 65535
//Aproximation pour eviter les entier 32bits (le dspic30F est 16bits), une unité d'angle vaut 0.296875°, perte de précision de 1,3%, AX12_DEGRE_TO_ANGLE(300) donne un angle réel de 296°, soit une perte de 4° pour un angle de 300°
#define AX12_DEGRE_TO_ANGLE(angle) ((((Uint16)(angle)) << 7) / 38)

//Vitesse max: 500°/seconde (83 tours/minute) (maximum supporté par la macro)
//Le max de l'ax12 indiqué par la datasheet est de environ 360°/s (60 tr/min)
#define AX12_MAX_DPS 500
#define AX12_SPEED_TO_DPS(angle_speed) ((((Uint16)(angle_speed))*85) >> 7) // >> 7 <=> / 128, 85/256 = 0.664 degres per second ~= 0.111 rpm (tours par minute)
#define AX12_DPS_TO_SPEED(angle_speed) ((((Uint16)(angle_speed)) << 7) / 85)

//Poucentage max: 100% (tout le monde le savait ça, mais c'est bien de le repréciser :) )
#define AX12_MAX_PERCENTAGE 100
#define AX12_1024_TO_PERCENTAGE(percentage) ((((Uint16)(percentage))*25) >> 8) // >> 8 <=> / 256, 25/256 = 100/1024
#define AX12_PERCENTAGE_TO_1024(percentage) ((((Uint16)(percentage)) << 8) / 25)

//Implementation

