samuelpoiraud/robot/STM32/QS/QS_ax12.c
bool_e AX12_is_ready(Uint8 id_servo) {
	return AX12_instruction_ping(id_servo);
}

AX12_status_t AX12_get_last_error(Uint8 id_servo) {
	return AX12_instruction_get_last_status(id_servo);
}

void AX12_reset_last_error(Uint8 id_servo) {
	AX12_instruction_reset_last_status(id_servo);
}

bool_e AX12_is_buffer_full() {
	return AX12_instruction_buffer_is_full();
}

void AX12_start_command_block() {
	AX12_prepare_commands = TRUE;
}

void AX12_end_command_block() {
	AX12_instruction_async_execute_write();
	AX12_prepare_commands = FALSE;
}

#if AX12_STATUS_RETURN_MODE != AX12_STATUS_RETURN_NEVER
bool_e AX12_config_is_locked(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_LOCK, NULL) != 0;
}

Uint16 AX12_config_get_model_number(Uint8 id_servo) {
	return AX12_instruction_read16(id_servo, AX12_MODEL_NUMBER_L, NULL);
}

Uint8  AX12_config_get_firmware_version(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_VERSION, NULL);
}

Uint16 AX12_config_get_return_delay_time(Uint8 id_servo) {
	return ((Uint16)AX12_instruction_read8(id_servo, AX12_RETURN_DELAY_TIME, NULL)) * 2;
}

Uint16 AX12_config_get_minimal_angle(Uint8 id_servo) {
	return AX12_ANGLE_TO_DEGRE(AX12_instruction_read16(id_servo, AX12_CW_ANGLE_LIMIT_L, NULL));
}

Uint16 AX12_config_get_maximal_angle(Uint8 id_servo) {
	return AX12_ANGLE_TO_DEGRE(AX12_instruction_read16(id_servo, AX12_CCW_ANGLE_LIMIT_L, NULL));
}

Uint8  AX12_config_get_temperature_limit(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_LIMIT_TEMPERATURE, NULL);
}

Uint8  AX12_config_get_lowest_voltage(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_DOWN_LIMIT_VOLTAGE, NULL);
}

Uint8  AX12_config_get_highest_voltage(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_UP_LIMIT_VOLTAGE, NULL);
}

Uint8 AX12_config_get_maximum_torque(Uint8 id_servo) {
	Uint16 value;    //On ne peut pas utiliser la lecture 16bits a cause d'un bug de l'AX12 (voir https://sites.google.com/site/robotsaustralia/ax-12dynamixelinformation)
	value = AX12_instruction_read8(id_servo, AX12_MAX_TORQUE_L, NULL) | (AX12_instruction_read8(id_servo, AX12_MAX_TORQUE_H, NULL) << 8);
	return (Uint8)AX12_1024_TO_PERCENTAGE(value);
}

Uint8  AX12_config_get_status_return_mode(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_RETURN_LEVEL, NULL);
}

Uint8  AX12_config_get_error_before_led(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_ALARM_LED, NULL);
}

Uint8  AX12_config_get_error_before_shutdown(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_ALARM_SHUTDOWN, NULL);
}
#endif //AX12_STATUS_RETURN_MODE != AX12_STATUS_RETURN_NEVER

bool_e AX12_config_lock(Uint8 id_servo) {
	return AX12_instruction_write8(id_servo, AX12_LOCK, 1);
}

bool_e AX12_config_set_id(Uint8 id_servo) {
	return AX12_instruction_write8(AX12_BROADCAST_ID, AX12_ID, id_servo);
}

bool_e AX12_config_set_return_delay_time(Uint8 id_servo, Uint16 delay_us) {
	return AX12_instruction_write8(id_servo, AX12_RETURN_DELAY_TIME, (Uint8)(delay_us >> 1)); // >> 1 <=> /2
}

bool_e AX12_config_set_minimal_angle(Uint8 id_servo, Uint16 degre) {
	if(degre > AX12_MAX_DEGRE) degre = AX12_MAX_DEGRE;
	return AX12_instruction_write16(id_servo, AX12_CW_ANGLE_LIMIT_L, AX12_DEGRE_TO_ANGLE(degre));
}

bool_e AX12_config_set_maximal_angle(Uint8 id_servo, Uint16 degre) {
	if(degre > AX12_MAX_DEGRE) degre = AX12_MAX_DEGRE;
	if(degre == 0) degre = 1;	//Si l'utilisateur met un angle mini et maxi à 0, l'AX12 passera en mode rotation en continue, ce mode ne doit être activé que par AX12_set_wheel_mode_enabled (en passant TRUE)
	return AX12_instruction_write16(id_servo, AX12_CCW_ANGLE_LIMIT_L, AX12_DEGRE_TO_ANGLE(degre));
}

bool_e AX12_config_set_temperature_limit(Uint8 id_servo, Uint8 temperature) {
	return AX12_instruction_write8(id_servo, AX12_LIMIT_TEMPERATURE, temperature);
}

bool_e AX12_config_set_lowest_voltage(Uint8 id_servo, Uint8 voltage) {
	return AX12_instruction_write8(id_servo, AX12_DOWN_LIMIT_VOLTAGE, voltage);
}

bool_e AX12_config_set_highest_voltage(Uint8 id_servo, Uint8 voltage) {
	return AX12_instruction_write8(id_servo, AX12_UP_LIMIT_VOLTAGE, voltage);
}

bool_e AX12_config_set_maximum_torque_percentage(Uint8 id_servo, Uint8 percentage) {
	Uint16 value = AX12_PERCENTAGE_TO_1024(percentage);
	return AX12_instruction_write16(id_servo, AX12_MAX_TORQUE_L, value);
}

bool_e AX12_config_set_status_return_mode(Uint8 id_servo, Uint8 mode) {
	return AX12_instruction_write8(id_servo, AX12_RETURN_LEVEL, mode);
}

bool_e AX12_config_set_error_before_led(Uint8 id_servo, Uint8 error_type) {
	return AX12_instruction_write8(id_servo, AX12_ALARM_LED, error_type);
}

bool_e AX12_config_set_error_before_shutdown(Uint8 id_servo, Uint8 error_type) {
	return AX12_instruction_write8(id_servo, AX12_ALARM_SHUTDOWN, error_type);
}


//RAM

bool_e AX12_is_wheel_mode_enabled(Uint8 id_servo) {
	return AX12_on_the_robot[id_servo].is_wheel_enabled;
}

#if AX12_STATUS_RETURN_MODE != AX12_STATUS_RETURN_NEVER
bool_e AX12_is_torque_enabled(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_TORQUE_ENABLE, NULL) != 0;
}

bool_e AX12_is_led_enabled(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_LED, NULL) != 0;
}

bool_e AX12_get_torque_response(Uint8 id_servo, Uint16* A, Uint16* B, Uint16* C, Uint16* D) {
	bool_e isOk;
	Uint8 CcwComplianceSlope;
	Uint8 CcwComplianceMargin;
	Uint8 CwComplianceMargin;
	Uint8 CwComplianceSlope;

	CcwComplianceSlope = AX12_instruction_read8(id_servo, AX12_CCW_COMPLIANCE_SLOPE, &isOk);
	if(!isOk) return FALSE;
	CcwComplianceMargin = AX12_instruction_read8(id_servo, AX12_CCW_COMPLIANCE_MARGIN, &isOk);
	if(!isOk) return FALSE;
	CwComplianceMargin = AX12_instruction_read8(id_servo, AX12_CW_COMPLIANCE_MARGIN, &isOk);
	if(!isOk) return FALSE;
	CwComplianceSlope = AX12_instruction_read8(id_servo, AX12_CW_COMPLIANCE_SLOPE, &isOk);
	if(!isOk) return FALSE;

	if(A) *A = AX12_ANGLE_TO_DEGRE(CcwComplianceSlope);
	if(B) *B = AX12_ANGLE_TO_DEGRE(CcwComplianceMargin);
	if(C) *C = AX12_ANGLE_TO_DEGRE(CwComplianceMargin);
	if(D) *D = AX12_ANGLE_TO_DEGRE(CwComplianceSlope);

