samuelpoiraud/robot/STM32/QS/QS_ax12.c
	return TRUE;
}

Uint16 AX12_get_position(Uint8 id_servo) {
	return AX12_ANGLE_TO_DEGRE(AX12_instruction_read16(id_servo, AX12_PRESENT_POSITION_L, NULL));
}

Sint16 AX12_get_move_to_position_speed(Uint8 id_servo) {
	bool_e isBackward;
	Uint16 speed;

	if(AX12_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("AX12: AX12_get_move_to_position_speed while in wheel mode, use AX12_get_speed_percentage instead.\n");
		return 0;
	}

	speed = AX12_instruction_read16(id_servo, AX12_PRESENT_SPEED_L, NULL);

	isBackward = (speed & 0x400) != 0;
	speed = AX12_SPEED_TO_DPS(speed & 0x3FF);
	if(isBackward)
		return -(Sint16)speed;
	return (Sint16)speed;
}

Sint8 AX12_get_speed_percentage(Uint8 id_servo) {
	bool_e isBackward;
	Uint16 speedPercentage;

	if(!AX12_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("AX12: AX12_get_speed_percentage while not in wheel mode, use AX12_get_move_to_position_speed instead.\n");
		return 0;
	}

	speedPercentage = AX12_instruction_read16(id_servo, AX12_PRESENT_SPEED_L, NULL);

	isBackward = (speedPercentage & 0x400) != 0;
	speedPercentage = AX12_1024_TO_PERCENTAGE(speedPercentage & 0x3FF);
	if(isBackward)
		return -(Sint8)speedPercentage;
	return (Sint8)speedPercentage;
}

Uint8 AX12_get_torque_limit(Uint8 id_servo) {
	return (Uint8)AX12_1024_TO_PERCENTAGE(AX12_instruction_read16(id_servo, AX12_TORQUE_LIMIT_L, NULL));
}

Uint8 AX12_get_punch_torque_percentage(Uint8 id_servo) {
	return (Uint8)AX12_1024_TO_PERCENTAGE(AX12_instruction_read16(id_servo, AX12_PUNCH_L, NULL));
}

Sint8 AX12_get_load_percentage(Uint8 id_servo) {
	bool_e isBackward;
	Uint16 loadPercentage;

	loadPercentage = AX12_instruction_read16(id_servo, AX12_PRESENT_LOAD_L, NULL);

	isBackward = (loadPercentage & 0x400) != 0;
	loadPercentage = AX12_1024_TO_PERCENTAGE(loadPercentage & 0x3FF);
	if(isBackward)
		return -(Sint8)loadPercentage;
	return (Sint8)loadPercentage;
}

Uint8 AX12_get_voltage(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_PRESENT_VOLTAGE, NULL);
}

Uint8 AX12_get_temperature(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_PRESENT_TEMPERATURE, NULL);
}

bool_e AX12_is_instruction_prepared(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_REGISTERED_INSTRUCTION, NULL) != 0;
}

bool_e AX12_is_moving(Uint8 id_servo) {
	return AX12_instruction_read8(id_servo, AX12_MOVING, NULL) != 0;
}


bool_e AX12_set_wheel_mode_enabled(Uint8 id_servo, bool_e enabled) {
	if(enabled == AX12_on_the_robot[id_servo].is_wheel_enabled)	//mode déja défini
		return TRUE;

	if(enabled) {	//sauvegarde les angles limite défini et passe en mode wheel
		Uint16 min_angle, max_angle;

		AX12_on_the_robot[id_servo].is_wheel_enabled = TRUE;

		min_angle = AX12_config_get_minimal_angle(id_servo);
		if(AX12_get_last_error(id_servo).error)
			return FALSE;

		max_angle = AX12_config_get_maximal_angle(id_servo);
		if(AX12_get_last_error(id_servo).error)
			return FALSE;
		if(max_angle == 0) max_angle = 1;	//évite les bugs si les 2 angles limites sont à 0 (et donc qu'on était déja en mode wheel mais que le servo ne le savait pas.

		if(!AX12_config_set_minimal_angle(id_servo, 0))
			return FALSE;
		if(!AX12_config_set_maximal_angle(id_servo, 0))
			return FALSE;

		AX12_on_the_robot[id_servo].angle_limit[0] = min_angle;
		AX12_on_the_robot[id_servo].angle_limit[1] = max_angle;

		return TRUE;
	} else {
		AX12_on_the_robot[id_servo].is_wheel_enabled = FALSE;
		if(!AX12_config_set_minimal_angle(id_servo, AX12_on_the_robot[id_servo].angle_limit[0]))
			return FALSE;
		if(!AX12_config_set_maximal_angle(id_servo, AX12_on_the_robot[id_servo].angle_limit[1]))
			return FALSE;
		return TRUE;
	}
}
#endif //AX12_STATUS_RETURN_MODE != AX12_STATUS_RETURN_NEVER

bool_e AX12_set_torque_enabled(Uint8 id_servo, bool_e enabled) {
	return AX12_instruction_write8(id_servo, AX12_TORQUE_ENABLE, enabled != 0);
}

bool_e AX12_set_led_enabled(Uint8 id_servo, bool_e enabled) {
	return AX12_instruction_write8(id_servo, AX12_LED, enabled != 0);
}

	/*
	Paramétrage de l'asservissement avec AX12_set_torque_response(A, B, C, D)
				Couple          Consigne de position
					^                   |
					|=============\     |
					|             ^\    |
	Sens anti-      |             | |   v
	  horaire     <-+-------------|-+=======+------------------->  Sens horaire
					|             | ^   ^   |             X: Erreur en position
					|             | |   |    \
					|             | |   |   ^ \===============
					v             | |   |   | ^
								  A B   0   C D

	=== : Courbe du couple en fonction de l'erreur en position
	Les points A, B, C, D sont la valeur absolue de la différence de position entre le point et la position consigne (en minute d'angle)
	Si la valeur absolue de l'erreur est plus grande que A (sens anti-horaire) ou D (sens horaire), le couple est constant quelque soit l'erreur
	Si la valeur absolue de l'erreur est entre A et B ou C et D, le couple est proportionnel à la valeur absolue de l'erreur (le courant minimal pour donner du couple est défini par les fonctions AX12_set_punch_current/AX12_get_punch_current)
	Si la valeur absolue de l'erreur est plus petite que B ou C, l'AX12 n'exerce aucun couple

	*/
bool_e AX12_set_torque_response(Uint8 id_servo, Uint16 A, Uint16 B, Uint16 C, Uint16 D) {
	Uint16 CcwComplianceSlope;
	Uint16 CcwComplianceMargin;
	Uint16 CwComplianceMargin;
	Uint16 CwComplianceSlope;

	//Limite d'angle max sinon si l'angle est trop élevé, AX12_DEGRE_TO_ANGLE pourrait renvoyer une valeur erronée a cause d'un overflow
	if(A > AX12_MAX_DEGRE)
		A = AX12_MAX_DEGRE;
	if(B > AX12_MAX_DEGRE)
		B = AX12_MAX_DEGRE;
	if(C > AX12_MAX_DEGRE)
		C = AX12_MAX_DEGRE;
	if(D > AX12_MAX_DEGRE)
		D = AX12_MAX_DEGRE;

	CcwComplianceSlope = AX12_DEGRE_TO_ANGLE(A);
	CcwComplianceMargin = AX12_DEGRE_TO_ANGLE(B);
	CwComplianceMargin = AX12_DEGRE_TO_ANGLE(C);
	CwComplianceSlope = AX12_DEGRE_TO_ANGLE(D);

	if(!AX12_instruction_async_write8(id_servo, AX12_CCW_COMPLIANCE_SLOPE, CcwComplianceSlope))
		return FALSE;
	if(!AX12_instruction_async_write8(id_servo, AX12_CCW_COMPLIANCE_MARGIN, CcwComplianceMargin))
		return FALSE;
	if(!AX12_instruction_async_write8(id_servo, AX12_CW_COMPLIANCE_MARGIN, CwComplianceMargin))
		return FALSE;
	if(!AX12_instruction_async_write8(id_servo, AX12_CW_COMPLIANCE_SLOPE, CwComplianceSlope))
		return FALSE;

	#if AX12_STATUS_RETURN_MODE == AX12_STATUS_RETURN_ALWAYS
		if(!AX12_instruction_wait(id_servo) || AX12_instruction_get_last_status(id_servo).error == 0)
			return FALSE;
	#endif

