samuelpoiraud/robot/STM32/QS/QS_ax12.c
	return TRUE;
}

bool_e AX12_set_position(Uint8 id_servo, Uint16 degre) {
	if(degre > AX12_MAX_DEGRE) degre = AX12_MAX_DEGRE;
	return AX12_instruction_write16(id_servo, AX12_GOAL_POSITION_L, AX12_DEGRE_TO_ANGLE(degre));
}

bool_e AX12_set_move_to_position_speed(Uint8 id_servo, Uint16 degre_per_sec) {
	if(AX12_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("AX12: AX12_set_move_to_position_speed while in wheel mode, use AX12_set_speed_percentage instead.\n");
		return FALSE;
	}

	if(degre_per_sec > AX12_MAX_DPS) degre_per_sec = AX12_MAX_DPS;
	return AX12_instruction_write16(id_servo, AX12_GOAL_SPEED_L, AX12_DPS_TO_SPEED(degre_per_sec));
}

bool_e AX12_set_speed_percentage(Uint8 id_servo, Sint8 percentage) {
	bool_e isBackward;

	if(!AX12_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("AX12: AX12_set_speed_percentage while not in wheel mode, use AX12_set_move_to_position_speed instead.\n");
		return FALSE;
	}

	isBackward = percentage < 0;
	//percentage & 0x7F: on enlève le bit de signe, isBackward << 10: ajoute 1024 si on tourne a l'envers
	percentage = percentage & 0x7F;
	if(percentage > AX12_MAX_PERCENTAGE) percentage = AX12_MAX_PERCENTAGE;
	Uint16 realValue = AX12_PERCENTAGE_TO_1024(percentage) | (((Uint16)isBackward) << 10);

	return AX12_instruction_write16(id_servo, AX12_GOAL_SPEED_L, realValue);
}

bool_e AX12_set_torque_limit(Uint8 id_servo, Uint8 percentage) {
	if(percentage > AX12_MAX_PERCENTAGE) percentage = AX12_MAX_PERCENTAGE;

	return AX12_instruction_write16(id_servo, AX12_TORQUE_LIMIT_L, AX12_PERCENTAGE_TO_1024(percentage));
}

bool_e AX12_set_punch_torque_percentage(Uint8 id_servo, Uint8 percentage) {
	if(percentage > AX12_MAX_PERCENTAGE) percentage = AX12_MAX_PERCENTAGE;

	return AX12_instruction_write16(id_servo, AX12_TORQUE_LIMIT_L, AX12_PERCENTAGE_TO_1024(percentage));
}

#endif /* def USE_AX12_SERVO */
